/*
Створити масив, довжину та елементи якого задає користувач.
Відсортувати масив за зростанням.
Видалити елементи з масиву з 2 по 4 (включно!).
У міру змін виводити вміст масиву на сторінку.
*/

let length = parseInt(prompt("Введіть довжину масиву:"));

if (isNaN(length) || length <= 0) {
    document.write("<p>Неправильний ввід. Будь ласка, введіть додатнє число для довжини масиву.</p>");
} else {
    let array = [];

    // Заповнюємо масив елементами, введеними користувачем
    for (let i = 0; i < length; i++) {
        let element = parseInt(prompt(`Введіть елемент масиву (${i+1}/${length}):`));
        if (!isNaN(element)) {
            array.push(element);
        } else {
            document.write("<p>Неправильне значення. Будь ласка, введіть число.</p>");
            break;
        }
    }

    // Виводимо початковий масив
    document.write("<p>Початковий масив: " + array.join(", ") + "</p>");


    // Сортуємо масив за зростанням
    /*
     array.sort(function(a, b) {
        return a - b;
      });
    */

    array.sort((a, b) => a - b);
    document.write("<p>Відсортований масив: " + array.join(", ") + "</p>");

    // Видаляємо елементи з 2 по 4 (включно)
    array.splice(1, 3);
    document.write("<p>Масив після видалення елементів з 2 по 4 (включно): " + array.join(", ") + "</p>");
}